--- a/README.md
+++ b/README.md
@@ -6,16 +6,26 @@ Docker-Stacks
-[TOC]
-
 ## Images Dependency
-```mermaid!
+```plantuml
+@startdot
+digraph G{
+ Jupyterlab_base ->Jupyter_general
+ Jupyter_general ->Jupyterlab_datascience
+ Jupyter_general ->Jupyterlab_tensorflow
+ Jupyter_general ->Jupyterlab_pyspark
+ Jupyterlab_datascience->Jupyterlab_decisiontree
+}
+@enddot
+```
+
+```mermaid
 graph TD
- Jupyterlab_base -->Jupyter_general;
- Jupyter_general -->Jupyterlab_datascience;
- Jupyter_general -->Jupyterlab_tensorflow;
- Jupyter_general -->Jupyterlab_pyspark;
- Jupyterlab_datascience-->Jupyterlab_decisiontree;
+ Jupyterlab_base -->Jupyter_general
+ Jupyter_general -->Jupyterlab_datascience
+ Jupyter_general -->Jupyterlab_tensorflow
+ Jupyter_general -->Jupyterlab_pyspark
+ Jupyterlab_datascience-->Jupyterlab_decisiontree
 ```
 
 Images Details
